{
  "albums": [
    {
      "albumTitle": "Innerspeaker",
      "shortTitle": "Innerspeaker",
      "description": "Innerspeaker is the debut studio album by Australian rock band Tame Impala. Recorded at a remote beach shack in Western Australia during the winter of 2009, the album was released on 21 May 2010 by Modular Recordings.",
      "imageURL": "tame_impala_innerspeaker.png",
      "songs": [
        "It Is Not Meant To Be",
        "Desire Be Desire Go",
        "Alter Ego",
        "Lucidity",
        "Why Won't You Make Up Your Mind?",
        "Solitude Is Bliss",
        "Jeremy's Storm",
        "Expectation",
        "Runway Houses City Clouds",
        "I Don't Really Mind"
      ]
    },
    {
      "albumTitle": "Lonerism",
      "shortTitle": "Lonerism",
      "description": "Lonerism is the second studio album by the Australian rock band Tame Impala, released on 5 October 2012 by Modular Recordings. Like the band's debut studio album, Innerspeaker (2010), Lonerism was written, recorded, performed, and produced by Kevin Parker, with live member Jay Watson contributing on two tracks. Recorded mostly in Perth, Australia, and Paris, France, Lonerism builds on the psychedelic sound of its predecessor by featuring fewer guitars and more synthesisers and samples.",
      "imageURL": "tame_impala_lonerism.jpg",
      "songs": [
        "Be Above It",
        "Endors Toi",
        "Apocalypse Dreams",
        "Mind Mischief",
        "Music To Walk Home By",
        "Why Won't They Talk To Me?",
        "Feels Like We Only Go Backwards",
        "Keep On Lying",
        "Elephant",
        "She Just Won't Believe Me",
        "Nothing That Has Happened So Far Has Been Anything We Could Control",
        "Sun's Coming Up"
      ]
    },
    {
      "albumTitle": "Currents",
      "shortTitle": "Currents",
      "description": "Currents is the third studio album by Australian musical project Tame Impala. It was released on 17 July 2015 by Modular Recordings and Universal Music Australia. In the United States it was released by Interscope Records and Fiction Records, while Caroline International released it in other international regions. Like the group's previous two albums, Currents was written, recorded, performed, and produced by primary member Kevin Parker. For the first time, Parker mixed the music and recorded all instruments by himself; the album featured no other collaborators.",
      "imageURL": "tame_Impala_currents.png",
      "songs": [
        "Let It Happen",
        "Nangs",
        "The Moment",
        "Yes I'm Changing",
        "Eventually",
        "Gossip",
        "The Less I Know The Better",
        "Past Life",
        "Disciples",
        "'Cause I'm A Man",
        "Reality In Motion",
        "Love/Paranoia",
        "Same Person, Same Old Mistakes"
      ]
    },
    {
      "albumTitle": "The Slow Rush",
      "shortTitle": "The_Slow_Rush",
      "description": "The Slow Rush is the fourth studio album by Australian musical project Tame Impala, released on 14 February 2020. It follows the 2015 album Currents and the 2019 singles 'Patience' and 'Borderline', with the latter serving as the first single from the album.",
      "imageURL": "tame_impala_the_slow_rush.jpg",
      "songs": [
        "One More Year",
        "Instant Destiny",
        "Borderline",
        "Posthumous Forgiveness",
        "Breathe Deeper",
        "Tomorrow's Dust",
        "On Track",
        "Lost In Yesterday",
        "Is It True",
        "It Might Be Time",
        "Glimmer",
        "One More Hour"
      ]
    }
  ]
}
